# GetNumOfWallBreaks

## Description
Gets the number of breaks in a wall.

```pascal
FUNCTION GetNumOfWallBreaks(
				wallH             : HANDLE;
				VAR numWallBreaks : INTEGER) : BOOLEAN;
```

```python

def vs.GetNumOfWallBreaks(wallH):
    return (BOOLEAN, numWallBreaks)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallH|HANDLE||
|numWallBreaks|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Objects - Walls